### 데이터 프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [4]:
s = pd.Series(range(10))
s[3] = np.nan       # nan은 정수가 아니라 실수
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()       # nan은 데이터 갯수에 포함하지 않음

9

In [6]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [7]:
df.count()      # 컬럼별로 계산되어 출력

0    4
1    4
2    4
3    3
dtype: int64

 - seaborn 패키지로  타이타닉호의 승객 데이터 프레임 읽어오기

In [8]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
titanic.count()     # 승객수

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기
- 시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 value_counts 메서드로 각각의 값이 나온 횟수를 셀 수 있다.

In [11]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [12]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

- 정렬

In [13]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [15]:
df[0].sort_values(ascending=False)

3    4.0
1    3.0
2    3.0
0    0.0
Name: 0, dtype: float64

In [16]:
df[3].sort_values()     # NaN은 제일 마지막에 옴

1    1.0
0    2.0
3    2.0
2    NaN
Name: 3, dtype: float64

In [17]:
df.sort_values(by = 0)      # by = 0, 제로번째 열로 나눈다!

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [18]:
titanic.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [19]:
titanic.embarked.value_counts().sort_index()

C    168
Q     77
S    644
Name: embarked, dtype: int64

- 행/열 합계
- 행은 0, 열은 1이다. 근데 계산할때는 행에대해서 구하려면 axis=1, 열에대해서는 axis=0 반대로씀

In [20]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [21]:
df2.sum(axis=1)     # 행방향 합계(행방향으로 값이 나오게 하려면 열방향으로 더해줘야하니까 axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [22]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [24]:
df2.sum()       # sum()에 지정해주지 않으면 디폴트값 0

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [25]:
df2.mean()

0          6.00
1          8.25
2          6.25
3          6.00
4          3.75
5          2.50
6          1.25
7          4.00
RowSum    38.00
dtype: float64

In [26]:
df2.std()

0         2.160247
1         0.957427
2         2.986079
3         2.160247
4         4.112988
5         3.109126
6         1.892969
7         2.943920
RowSum    4.082483
dtype: float64

In [27]:
df2.describe()

,0,1,2,3,4,5,6,7,RowSum
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.00000,4.000000
mean,6.000000,8.250000,6.250000,6.000000,3.750000,2.500000,1.250000,4.00000,38.000000
std,2.160247,0.957427,2.986079,2.160247,4.112988,3.109126,1.892969,2.94392,4.082483
min,4.000000,7.000000,2.000000,4.000000,0.000000,0.000000,0.000000,1.00000,34.000000
25%,4.750000,7.750000,5.750000,4.750000,0.750000,0.750000,0.000000,1.75000,34.750000
50%,5.500000,8.500000,7.000000,5.500000,3.000000,1.500000,0.500000,4.00000,38.000000
75%,6.750000,9.000000,7.500000,6.750000,6.000000,3.250000,1.750000,6.25000,41.250000
max,9.000000,9.000000,9.000000,9.000000,9.000000,7.000000,4.000000,7.00000,42.000000

- apply 변환

In [28]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [29]:
df3.apply(lambda x: x.max() - x.min())  # 각 열의 최대값-최소값차이를 구하고싶음 lambda사용용

A    3
B    2
C    4
dtype: int64

In [30]:
df3.apply(lambda x: x.max() - x.min(), axis=1)  # 행에 대해서 적용

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [32]:
titanic['adult/child'] = titanic.apply(
    lambda r: 'adult' if r.age >= 20 else 'child', axis = 1
)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

- fillna
- NaN 값은 fillna 메서드를 사용하여 원하는 값으로 바꿀 수 있다.

In [33]:
titanic.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [36]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [38]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

- astype 메소드

In [39]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

- 실수 값을 카테고리 값으로 변환

In [40]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [41]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats
# 결과값: 0은 1 보다 작기 때문에 NaN

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [42]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [43]:
# qcut명령: 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다.
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']